Revit 2026 API

# View3DToggleToIsometric Method

---

Toggles this view to isometric.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public void ToggleToIsometric()
```
```vb
Public Sub ToggleToIsometric
```
```cpp
public:
void ToggleToIsometric()
```
```fsharp
member ToggleToIsometric : unit -> unit
```

| Exception | Condition |
| --- | --- |
| InvalidOperationException | This view cannot be toggled. |

This view can only be toggled to isometric if no view specific elements are contained.

#### Reference

View3D Class

Autodesk.Revit.DB Namespace